/**
 * Export Import Edit XML.
 * @author Alexey Osetsky (alexeyosetsky@gmail.com)
 * @version $Id$
 * @since 08.04.2018
 */
package ru.osetsky.jdbc;
 /*
  * Данный модуль записывает указанное количество элементов в методе main в базу, затем
  * берет элементы из базы и записывает в 1.xml файл, после чего преобразует 1.xml файл в 2.xml с помощью xlst
  * и парсит файл 2.xml, считает сумму всех элементов и выводит значение в консоль.
  *
  * Данный модуль является разминкой перед написание полноценного парсера.
  */
